id: FLb0-ZIBR8PJoGzFRWwn
logsource:
  product: cloudtrail
title: OCSF-1.1.0-CT-Event-Rule
description: Rule that generates an alert when a specific event is detected
tags: []
falsepositives: []
level: medium
status: experimental
references: []
author: Kevin Low
detection:
  condition: Selection_1
  Selection_1:
    api.operation|contains:
      - UpdateInstanceInformation
      - PutEvaluations